cfd/case/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
scale   1;

// External-aero box around a disc centred at origin (disc Ø0.212, z 0..0.02).
// Upstream ~5d, downstream ~14d, +/-5d lateral & vertical.
vertices
(
    (-1 -1 -1)
    ( 3 -1 -1)
    ( 3  1 -1)
    (-1  1 -1)
    (-1 -1  1)
    ( 3 -1  1)
    ( 3  1  1)
    (-1  1  1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 40 40) simpleGrading (1 1 1)
);

edges ( );

boundary
(
    farfield
    {
        type patch;
        faces
        (
            (0 3 2 1)   // z-min
            (4 5 6 7)   // z-max
            (0 1 5 4)   // y-min
            (2 3 7 6)   // y-max
            (0 4 7 3)   // x-min (inlet)
            (1 2 6 5)   // x-max (outlet)
        );
    }
);

mergePatchPairs ( );
