cfd/case/system/snappyHexMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object snappyHexMeshDict; }

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    disc.stl
    {
        type triSurfaceMesh;
        name disc;
    }
    nearField
    {
        type searchableBox;
        min (-0.25 -0.20 -0.15);
        max ( 0.55  0.20  0.15);
    }
}

castellatedMeshControls
{
    maxLocalCells       3000000;
    maxGlobalCells      3000000;
    minRefinementCells  10;
    nCellsBetweenLevels 3;
    resolveFeatureAngle 30;
    allowFreeStandingZoneFaces true;
    features ( );

    refinementSurfaces
    {
        disc
        {
            // validated wall-function-regime resolution (y+ > 30). Finer than
            // this (level 5 + more layers) drops y+ into the invalid buffer layer.
            level (3 4);
            patchInfo { type wall; }
        }
    }

    refinementRegions
    {
        nearField
        {
            mode inside;
            levels ((1e15 2));
        }
    }

    locationInMesh (1.0 0.0 0.5);
}

snapControls
{
    nSmoothPatch        3;
    tolerance           2.0;
    nSolveIter          30;
    nRelaxIter          5;
    implicitFeatureSnap true;
    explicitFeatureSnap false;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes       true;
    layers
    {
        disc { nSurfaceLayers 3; }
    }
    expansionRatio          1.2;
    finalLayerThickness     0.4;
    minThickness            0.05;
    nGrow                   0;
    featureAngle            130;
    nRelaxIter              5;
    nSmoothSurfaceNormals   1;
    nSmoothNormals          3;
    nSmoothThickness        10;
    maxFaceThicknessRatio   0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle      90;
    nBufferCellsNoExtrude   0;
    nLayerIter              50;
}

meshQualityControls
{
    maxNonOrtho             65;
    maxBoundarySkewness     20;
    maxInternalSkewness     4;
    maxConcave              80;
    minVol                  1e-13;
    minTetQuality           1e-15;
    minArea                 -1;
    minTwist                0.02;
    minDeterminant          0.001;
    minFaceWeight           0.02;
    minVolRatio             0.01;
    minTriangleTwist        -1;
    nSmoothScale            4;
    errorReduction          0.75;
    relaxed { maxNonOrtho   75; }
}

writeFlags ( scalarLevels layerSets layerFields );
mergeTolerance 1e-6;
