cfd/case/0/U
FoamFile { version 2.0; format ascii; class volVectorField; object U; }
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (26.75 0 0);
boundaryField
{
    farfield
    {
        type            freestreamVelocity;
        freestreamValue uniform (26.75 0 0);
    }
    disc
    {
        type            noSlip;
    }
}
