cfd/case/0/k
FoamFile { version 2.0; format ascii; class volScalarField; object k; }
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.026834;
boundaryField
{
    farfield
    {
        type            inletOutlet;
        inletValue      uniform 0.026834;
        value           uniform 0.026834;
    }
    disc
    {
        type            kqRWallFunction;
        value           uniform 0.026834;
    }
}
