cfd/case/0/nut
FoamFile { version 2.0; format ascii; class volScalarField; object nut; }
dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0.001332;
boundaryField
{
    farfield
    {
        type            calculated;
        value           uniform 0.001332;
    }
    disc
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}
